package com.example.popjomemasjidi.activitys

import android.content.Intent
import androidx.appcompat.app.AppCompatActivity
import android.os.Bundle
import androidx.recyclerview.widget.LinearLayoutManager
import com.example.popjomemasjidi.activitys.adapters.MorningZikrsAdapter
import com.example.popjomemasjidi.activitys.models.MorningZikrsModel
import com.example.popjomemasjidi.models.FeaturesModel
import com.example.popjomemasjidi.utils.OnItemClickListener
import android.R
import com.example.popjomemasjidi.databinding.ActivityAllZikrsBinding


class AllZikrsActivity : AppCompatActivity() {


    private lateinit var binding: ActivityAllZikrsBinding

    var items10 = arrayOf(
        MorningZikrsModel("بِسمِ اللَّهِ الرَّحمٰنِ الرَّحيمِ\n" +
                "اللَّهُ لا إِلٰهَ إِلاَّ هُوَ الحَيُّ القَيّومُ ۚ لا تَأخُذُهُ سِنَةٌ وَلا نَومٌ ۚ لَهُ ما فِي السَّماواتِ وَما فِي الأَرضِ ۗ مَن ذَا الَّذي يَشفَعُ عِندَهُ إِلاَّ بِإِذنِهِ ۚ يَعلَمُ ما بَينَ أَيديهِم وَما خَلفَهُم ۖ وَلا يُحيطونَ بِشَيءٍ مِن عِلمِهِ إِلاَّ بِما شاءَ ۚ وَسِعَ كُرسِيُّهُ السَّماواتِ وَالأَرضَ ۖ وَلا يَئودُهُ حِفظُهُما ۚ وَهُوَ العَلِيُّ العَظيمُ\n", "Бисмиллаҳир роҳманир роҳийм. Аллоҳу лаа илаҳа иллаҳув алҳаййул қойюм. Лаа таъхузуҳу синатув валаа навм. Лаҳуу маа фис самаваати ва маа фил арз. Ман заллазий йашфаъу ъиндаху иллаа биизниҳ. Йаъламу маа байна айдийҳим ва маа холфаҳум. Ва лаа йуҳийтувна бишайъим мин ъилмиҳи илла бимаа шаа. Васиъа курсиййуҳус самаваати вал арз. Ва лаа йаувдуҳу ҳифзуҳума ва ҳувал ъалиййул ъазийм.\n","Меҳрибон ва раҳмли Аллоҳнинг номи ила бошлайман.\n" +
                "Аллоҳ, Ундан ўзга илоҳ йўқ. У тирикдир ва қаййумдир. Уни мудроқ ҳам,  уйқу ҳам олмас. Осмонлару ердаги нарсалар Уникидир. Унинг ҳузурида ўзининг изнисиз ҳеч ким шафоат қила олмас.  У уларнинг олдиларидаги нарсани ҳам, ортларидаги нарсани ҳам билур. Унинг илмидан ҳеч нарсани иҳота қила олмаслар, магар ўзи хоҳлаганини, холос. Унинг курсиси осмонлару ерни қамраган. У уларни муҳофаза қилишдан чарчамас. Ва У Алий ва Азим зотдир.\n",R.drawable.ic_menu_share),
MorningZikrsModel("بِسمِ اللَّهِ الرَّحمٰنِ الرَّحيمِ\n" +
                "اللَّهُ لا إِلٰهَ إِلاَّ هُوَ الحَيُّ القَيّومُ ۚ لا تَأخُذُهُ سِنَةٌ وَلا نَومٌ ۚ لَهُ ما فِي السَّماواتِ وَما فِي الأَرضِ ۗ مَن ذَا الَّذي يَشفَعُ عِندَهُ إِلاَّ بِإِذنِهِ ۚ يَعلَمُ ما بَينَ أَيديهِم وَما خَلفَهُم ۖ وَلا يُحيطونَ بِشَيءٍ مِن عِلمِهِ إِلاَّ بِما شاءَ ۚ وَسِعَ كُرسِيُّهُ السَّماواتِ وَالأَرضَ ۖ وَلا يَئودُهُ حِفظُهُما ۚ وَهُوَ العَلِيُّ العَظيمُ\n", "Бисмиллаҳир роҳманир роҳийм. Аллоҳу лаа илаҳа иллаҳув алҳаййул қойюм. Лаа таъхузуҳу синатув валаа навм. Лаҳуу маа фис самаваати ва маа фил арз. Ман заллазий йашфаъу ъиндаху иллаа биизниҳ. Йаъламу маа байна айдийҳим ва маа холфаҳум. Ва лаа йуҳийтувна бишайъим мин ъилмиҳи илла бимаа шаа. Васиъа курсиййуҳус самаваати вал арз. Ва лаа йаувдуҳу ҳифзуҳума ва ҳувал ъалиййул ъазийм.\n","Меҳрибон ва раҳмли Аллоҳнинг номи ила бошлайман.\n" +
                "Аллоҳ, Ундан ўзга илоҳ йўқ. У тирикдир ва қаййумдир. Уни мудроқ ҳам,  уйқу ҳам олмас. Осмонлару ердаги нарсалар Уникидир. Унинг ҳузурида ўзининг изнисиз ҳеч ким шафоат қила олмас.  У уларнинг олдиларидаги нарсани ҳам, ортларидаги нарсани ҳам билур. Унинг илмидан ҳеч нарсани иҳота қила олмаслар, магар ўзи хоҳлаганини, холос. Унинг курсиси осмонлару ерни қамраган. У уларни муҳофаза қилишдан чарчамас. Ва У Алий ва Азим зотдир.\n",R.drawable.ic_menu_share),
MorningZikrsModel("بِسمِ اللَّهِ الرَّحمٰنِ الرَّحيمِ\n" +
                "اللَّهُ لا إِلٰهَ إِلاَّ هُوَ الحَيُّ القَيّومُ ۚ لا تَأخُذُهُ سِنَةٌ وَلا نَومٌ ۚ لَهُ ما فِي السَّماواتِ وَما فِي الأَرضِ ۗ مَن ذَا الَّذي يَشفَعُ عِندَهُ إِلاَّ بِإِذنِهِ ۚ يَعلَمُ ما بَينَ أَيديهِم وَما خَلفَهُم ۖ وَلا يُحيطونَ بِشَيءٍ مِن عِلمِهِ إِلاَّ بِما شاءَ ۚ وَسِعَ كُرسِيُّهُ السَّماواتِ وَالأَرضَ ۖ وَلا يَئودُهُ حِفظُهُما ۚ وَهُوَ العَلِيُّ العَظيمُ\n", "Бисмиллаҳир роҳманир роҳийм. Аллоҳу лаа илаҳа иллаҳув алҳаййул қойюм. Лаа таъхузуҳу синатув валаа навм. Лаҳуу маа фис самаваати ва маа фил арз. Ман заллазий йашфаъу ъиндаху иллаа биизниҳ. Йаъламу маа байна айдийҳим ва маа холфаҳум. Ва лаа йуҳийтувна бишайъим мин ъилмиҳи илла бимаа шаа. Васиъа курсиййуҳус самаваати вал арз. Ва лаа йаувдуҳу ҳифзуҳума ва ҳувал ъалиййул ъазийм.\n","Меҳрибон ва раҳмли Аллоҳнинг номи ила бошлайман.\n" +
                "Аллоҳ, Ундан ўзга илоҳ йўқ. У тирикдир ва қаййумдир. Уни мудроқ ҳам,  уйқу ҳам олмас. Осмонлару ердаги нарсалар Уникидир. Унинг ҳузурида ўзининг изнисиз ҳеч ким шафоат қила олмас.  У уларнинг олдиларидаги нарсани ҳам, ортларидаги нарсани ҳам билур. Унинг илмидан ҳеч нарсани иҳота қила олмаслар, магар ўзи хоҳлаганини, холос. Унинг курсиси осмонлару ерни қамраган. У уларни муҳофаза қилишдан чарчамас. Ва У Алий ва Азим зотдир.\n",R.drawable.ic_menu_share),
MorningZikrsModel("بِسمِ اللَّهِ الرَّحمٰنِ الرَّحيمِ\n" +
                "اللَّهُ لا إِلٰهَ إِلاَّ هُوَ الحَيُّ القَيّومُ ۚ لا تَأخُذُهُ سِنَةٌ وَلا نَومٌ ۚ لَهُ ما فِي السَّماواتِ وَما فِي الأَرضِ ۗ مَن ذَا الَّذي يَشفَعُ عِندَهُ إِلاَّ بِإِذنِهِ ۚ يَعلَمُ ما بَينَ أَيديهِم وَما خَلفَهُم ۖ وَلا يُحيطونَ بِشَيءٍ مِن عِلمِهِ إِلاَّ بِما شاءَ ۚ وَسِعَ كُرسِيُّهُ السَّماواتِ وَالأَرضَ ۖ وَلا يَئودُهُ حِفظُهُما ۚ وَهُوَ العَلِيُّ العَظيمُ\n", "Бисмиллаҳир роҳманир роҳийм. Аллоҳу лаа илаҳа иллаҳув алҳаййул қойюм. Лаа таъхузуҳу синатув валаа навм. Лаҳуу маа фис самаваати ва маа фил арз. Ман заллазий йашфаъу ъиндаху иллаа биизниҳ. Йаъламу маа байна айдийҳим ва маа холфаҳум. Ва лаа йуҳийтувна бишайъим мин ъилмиҳи илла бимаа шаа. Васиъа курсиййуҳус самаваати вал арз. Ва лаа йаувдуҳу ҳифзуҳума ва ҳувал ъалиййул ъазийм.\n","Меҳрибон ва раҳмли Аллоҳнинг номи ила бошлайман.\n" +
                "Аллоҳ, Ундан ўзга илоҳ йўқ. У тирикдир ва қаййумдир. Уни мудроқ ҳам,  уйқу ҳам олмас. Осмонлару ердаги нарсалар Уникидир. Унинг ҳузурида ўзининг изнисиз ҳеч ким шафоат қила олмас.  У уларнинг олдиларидаги нарсани ҳам, ортларидаги нарсани ҳам билур. Унинг илмидан ҳеч нарсани иҳота қила олмаслар, магар ўзи хоҳлаганини, холос. Унинг курсиси осмонлару ерни қамраган. У уларни муҳофаза қилишдан чарчамас. Ва У Алий ва Азим зотдир.\n",R.drawable.ic_menu_share),
MorningZikrsModel("بِسمِ اللَّهِ الرَّحمٰنِ الرَّحيمِ\n" +
                "اللَّهُ لا إِلٰهَ إِلاَّ هُوَ الحَيُّ القَيّومُ ۚ لا تَأخُذُهُ سِنَةٌ وَلا نَومٌ ۚ لَهُ ما فِي السَّماواتِ وَما فِي الأَرضِ ۗ مَن ذَا الَّذي يَشفَعُ عِندَهُ إِلاَّ بِإِذنِهِ ۚ يَعلَمُ ما بَينَ أَيديهِم وَما خَلفَهُم ۖ وَلا يُحيطونَ بِشَيءٍ مِن عِلمِهِ إِلاَّ بِما شاءَ ۚ وَسِعَ كُرسِيُّهُ السَّماواتِ وَالأَرضَ ۖ وَلا يَئودُهُ حِفظُهُما ۚ وَهُوَ العَلِيُّ العَظيمُ\n", "Бисмиллаҳир роҳманир роҳийм. Аллоҳу лаа илаҳа иллаҳув алҳаййул қойюм. Лаа таъхузуҳу синатув валаа навм. Лаҳуу маа фис самаваати ва маа фил арз. Ман заллазий йашфаъу ъиндаху иллаа биизниҳ. Йаъламу маа байна айдийҳим ва маа холфаҳум. Ва лаа йуҳийтувна бишайъим мин ъилмиҳи илла бимаа шаа. Васиъа курсиййуҳус самаваати вал арз. Ва лаа йаувдуҳу ҳифзуҳума ва ҳувал ъалиййул ъазийм.\n","Меҳрибон ва раҳмли Аллоҳнинг номи ила бошлайман.\n" +
                "Аллоҳ, Ундан ўзга илоҳ йўқ. У тирикдир ва қаййумдир. Уни мудроқ ҳам,  уйқу ҳам олмас. Осмонлару ердаги нарсалар Уникидир. Унинг ҳузурида ўзининг изнисиз ҳеч ким шафоат қила олмас.  У уларнинг олдиларидаги нарсани ҳам, ортларидаги нарсани ҳам билур. Унинг илмидан ҳеч нарсани иҳота қила олмаслар, магар ўзи хоҳлаганини, холос. Унинг курсиси осмонлару ерни қамраган. У уларни муҳофаза қилишдан чарчамас. Ва У Алий ва Азим зотдир.\n",R.drawable.ic_menu_share),
MorningZikrsModel("بِسمِ اللَّهِ الرَّحمٰنِ الرَّحيمِ\n" +
                "اللَّهُ لا إِلٰهَ إِلاَّ هُوَ الحَيُّ القَيّومُ ۚ لا تَأخُذُهُ سِنَةٌ وَلا نَومٌ ۚ لَهُ ما فِي السَّماواتِ وَما فِي الأَرضِ ۗ مَن ذَا الَّذي يَشفَعُ عِندَهُ إِلاَّ بِإِذنِهِ ۚ يَعلَمُ ما بَينَ أَيديهِم وَما خَلفَهُم ۖ وَلا يُحيطونَ بِشَيءٍ مِن عِلمِهِ إِلاَّ بِما شاءَ ۚ وَسِعَ كُرسِيُّهُ السَّماواتِ وَالأَرضَ ۖ وَلا يَئودُهُ حِفظُهُما ۚ وَهُوَ العَلِيُّ العَظيمُ\n", "Бисмиллаҳир роҳманир роҳийм. Аллоҳу лаа илаҳа иллаҳув алҳаййул қойюм. Лаа таъхузуҳу синатув валаа навм. Лаҳуу маа фис самаваати ва маа фил арз. Ман заллазий йашфаъу ъиндаху иллаа биизниҳ. Йаъламу маа байна айдийҳим ва маа холфаҳум. Ва лаа йуҳийтувна бишайъим мин ъилмиҳи илла бимаа шаа. Васиъа курсиййуҳус самаваати вал арз. Ва лаа йаувдуҳу ҳифзуҳума ва ҳувал ъалиййул ъазийм.\n","Меҳрибон ва раҳмли Аллоҳнинг номи ила бошлайман.\n" +
                "Аллоҳ, Ундан ўзга илоҳ йўқ. У тирикдир ва қаййумдир. Уни мудроқ ҳам,  уйқу ҳам олмас. Осмонлару ердаги нарсалар Уникидир. Унинг ҳузурида ўзининг изнисиз ҳеч ким шафоат қила олмас.  У уларнинг олдиларидаги нарсани ҳам, ортларидаги нарсани ҳам билур. Унинг илмидан ҳеч нарсани иҳота қила олмаслар, магар ўзи хоҳлаганини, холос. Унинг курсиси осмонлару ерни қамраган. У уларни муҳофаза қилишдан чарчамас. Ва У Алий ва Азим зотдир.\n",R.drawable.ic_menu_share),
MorningZikrsModel("بِسمِ اللَّهِ الرَّحمٰنِ الرَّحيمِ\n" +
                "اللَّهُ لا إِلٰهَ إِلاَّ هُوَ الحَيُّ القَيّومُ ۚ لا تَأخُذُهُ سِنَةٌ وَلا نَومٌ ۚ لَهُ ما فِي السَّماواتِ وَما فِي الأَرضِ ۗ مَن ذَا الَّذي يَشفَعُ عِندَهُ إِلاَّ بِإِذنِهِ ۚ يَعلَمُ ما بَينَ أَيديهِم وَما خَلفَهُم ۖ وَلا يُحيطونَ بِشَيءٍ مِن عِلمِهِ إِلاَّ بِما شاءَ ۚ وَسِعَ كُرسِيُّهُ السَّماواتِ وَالأَرضَ ۖ وَلا يَئودُهُ حِفظُهُما ۚ وَهُوَ العَلِيُّ العَظيمُ\n", "Бисмиллаҳир роҳманир роҳийм. Аллоҳу лаа илаҳа иллаҳув алҳаййул қойюм. Лаа таъхузуҳу синатув валаа навм. Лаҳуу маа фис самаваати ва маа фил арз. Ман заллазий йашфаъу ъиндаху иллаа биизниҳ. Йаъламу маа байна айдийҳим ва маа холфаҳум. Ва лаа йуҳийтувна бишайъим мин ъилмиҳи илла бимаа шаа. Васиъа курсиййуҳус самаваати вал арз. Ва лаа йаувдуҳу ҳифзуҳума ва ҳувал ъалиййул ъазийм.\n","Меҳрибон ва раҳмли Аллоҳнинг номи ила бошлайман.\n" +
                "Аллоҳ, Ундан ўзга илоҳ йўқ. У тирикдир ва қаййумдир. Уни мудроқ ҳам,  уйқу ҳам олмас. Осмонлару ердаги нарсалар Уникидир. Унинг ҳузурида ўзининг изнисиз ҳеч ким шафоат қила олмас.  У уларнинг олдиларидаги нарсани ҳам, ортларидаги нарсани ҳам билур. Унинг илмидан ҳеч нарсани иҳота қила олмаслар, магар ўзи хоҳлаганини, холос. Унинг курсиси осмонлару ерни қамраган. У уларни муҳофаза қилишдан чарчамас. Ва У Алий ва Азим зотдир.\n",R.drawable.ic_menu_share),
    )

    var items11 = arrayOf(
        MorningZikrsModel("بِسمِ اللَّهِ الرَّحمٰنِ الرَّحيمِ\n" +
                "اللَّهُ لا إِلٰهَ إِلاَّ هُوَ الحَيُّ القَيّومُ ۚ لا تَأخُذُهُ سِنَةٌ وَلا نَومٌ ۚ لَهُ ما فِي السَّماواتِ وَما فِي الأَرضِ ۗ مَن ذَا الَّذي يَشفَعُ عِندَهُ إِلاَّ بِإِذنِهِ ۚ يَعلَمُ ما بَينَ أَيديهِم وَما خَلفَهُم ۖ وَلا يُحيطونَ بِشَيءٍ مِن عِلمِهِ إِلاَّ بِما شاءَ ۚ وَسِعَ كُرسِيُّهُ السَّماواتِ وَالأَرضَ ۖ وَلا يَئودُهُ حِفظُهُما ۚ وَهُوَ العَلِيُّ العَظيمُ\n", "Бисмиллаҳир роҳманир роҳийм. Аллоҳу лаа илаҳа иллаҳув алҳаййул қойюм. Лаа таъхузуҳу синатув валаа навм. Лаҳуу маа фис самаваати ва маа фил арз. Ман заллазий йашфаъу ъиндаху иллаа биизниҳ. Йаъламу маа байна айдийҳим ва маа холфаҳум. Ва лаа йуҳийтувна бишайъим мин ъилмиҳи илла бимаа шаа. Васиъа курсиййуҳус самаваати вал арз. Ва лаа йаувдуҳу ҳифзуҳума ва ҳувал ъалиййул ъазийм.\n","Меҳрибон ва раҳмли Аллоҳнинг номи ила бошлайман.\n" +
                "Аллоҳ, Ундан ўзга илоҳ йўқ. У тирикдир ва қаййумдир. Уни мудроқ ҳам,  уйқу ҳам олмас. Осмонлару ердаги нарсалар Уникидир. Унинг ҳузурида ўзининг изнисиз ҳеч ким шафоат қила олмас.  У уларнинг олдиларидаги нарсани ҳам, ортларидаги нарсани ҳам билур. Унинг илмидан ҳеч нарсани иҳота қила олмаслар, магар ўзи хоҳлаганини, холос. Унинг курсиси осмонлару ерни қамраган. У уларни муҳофаза қилишдан чарчамас. Ва У Алий ва Азим зотдир.\n",R.drawable.ic_menu_share),
        MorningZikrsModel("بِسمِ اللَّهِ الرَّحمٰنِ الرَّحيمِ\n" +
                "اللَّهُ لا إِلٰهَ إِلاَّ هُوَ الحَيُّ القَيّومُ ۚ لا تَأخُذُهُ سِنَةٌ وَلا نَومٌ ۚ لَهُ ما فِي السَّماواتِ وَما فِي الأَرضِ ۗ مَن ذَا الَّذي يَشفَعُ عِندَهُ إِلاَّ بِإِذنِهِ ۚ يَعلَمُ ما بَينَ أَيديهِم وَما خَلفَهُم ۖ وَلا يُحيطونَ بِشَيءٍ مِن عِلمِهِ إِلاَّ بِما شاءَ ۚ وَسِعَ كُرسِيُّهُ السَّماواتِ وَالأَرضَ ۖ وَلا يَئودُهُ حِفظُهُما ۚ وَهُوَ العَلِيُّ العَظيمُ\n", "Бисмиллаҳир роҳманир роҳийм. Аллоҳу лаа илаҳа иллаҳув алҳаййул қойюм. Лаа таъхузуҳу синатув валаа навм. Лаҳуу маа фис самаваати ва маа фил арз. Ман заллазий йашфаъу ъиндаху иллаа биизниҳ. Йаъламу маа байна айдийҳим ва маа холфаҳум. Ва лаа йуҳийтувна бишайъим мин ъилмиҳи илла бимаа шаа. Васиъа курсиййуҳус самаваати вал арз. Ва лаа йаувдуҳу ҳифзуҳума ва ҳувал ъалиййул ъазийм.\n","Меҳрибон ва раҳмли Аллоҳнинг номи ила бошлайман.\n" +
                "Аллоҳ, Ундан ўзга илоҳ йўқ. У тирикдир ва қаййумдир. Уни мудроқ ҳам,  уйқу ҳам олмас. Осмонлару ердаги нарсалар Уникидир. Унинг ҳузурида ўзининг изнисиз ҳеч ким шафоат қила олмас.  У уларнинг олдиларидаги нарсани ҳам, ортларидаги нарсани ҳам билур. Унинг илмидан ҳеч нарсани иҳота қила олмаслар, магар ўзи хоҳлаганини, холос. Унинг курсиси осмонлару ерни қамраган. У уларни муҳофаза қилишдан чарчамас. Ва У Алий ва Азим зотдир.\n",R.drawable.ic_menu_share),
        MorningZikrsModel("بِسمِ اللَّهِ الرَّحمٰنِ الرَّحيمِ\n" +
                "اللَّهُ لا إِلٰهَ إِلاَّ هُوَ الحَيُّ القَيّومُ ۚ لا تَأخُذُهُ سِنَةٌ وَلا نَومٌ ۚ لَهُ ما فِي السَّماواتِ وَما فِي الأَرضِ ۗ مَن ذَا الَّذي يَشفَعُ عِندَهُ إِلاَّ بِإِذنِهِ ۚ يَعلَمُ ما بَينَ أَيديهِم وَما خَلفَهُم ۖ وَلا يُحيطونَ بِشَيءٍ مِن عِلمِهِ إِلاَّ بِما شاءَ ۚ وَسِعَ كُرسِيُّهُ السَّماواتِ وَالأَرضَ ۖ وَلا يَئودُهُ حِفظُهُما ۚ وَهُوَ العَلِيُّ العَظيمُ\n", "Бисмиллаҳир роҳманир роҳийм. Аллоҳу лаа илаҳа иллаҳув алҳаййул қойюм. Лаа таъхузуҳу синатув валаа навм. Лаҳуу маа фис самаваати ва маа фил арз. Ман заллазий йашфаъу ъиндаху иллаа биизниҳ. Йаъламу маа байна айдийҳим ва маа холфаҳум. Ва лаа йуҳийтувна бишайъим мин ъилмиҳи илла бимаа шаа. Васиъа курсиййуҳус самаваати вал арз. Ва лаа йаувдуҳу ҳифзуҳума ва ҳувал ъалиййул ъазийм.\n","Меҳрибон ва раҳмли Аллоҳнинг номи ила бошлайман.\n" +
                "Аллоҳ, Ундан ўзга илоҳ йўқ. У тирикдир ва қаййумдир. Уни мудроқ ҳам,  уйқу ҳам олмас. Осмонлару ердаги нарсалар Уникидир. Унинг ҳузурида ўзининг изнисиз ҳеч ким шафоат қила олмас.  У уларнинг олдиларидаги нарсани ҳам, ортларидаги нарсани ҳам билур. Унинг илмидан ҳеч нарсани иҳота қила олмаслар, магар ўзи хоҳлаганини, холос. Унинг курсиси осмонлару ерни қамраган. У уларни муҳофаза қилишдан чарчамас. Ва У Алий ва Азим зотдир.\n",R.drawable.ic_menu_share),
    )

    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)
        binding = ActivityAllZikrsBinding.inflate(layoutInflater)
        setContentView(binding.root)

        val size: Int = intent.getIntExtra("extra_data", 0)
        if (size==1){
            binding.rv10.layoutManager = LinearLayoutManager(this, LinearLayoutManager.VERTICAL,false)
            binding.rv10.adapter = MorningZikrsAdapter(items10, object : OnItemClickListener {
                override fun onItemClick(tests: FeaturesModel?) {
                }
                override fun onItemImageClickListener(zikrs: MorningZikrsModel?) {
                    val shareIntent1 = Intent(Intent.ACTION_SEND)
                    shareIntent1.type = "text/plain"
                    shareIntent1.putExtra(Intent.EXTRA_SUBJECT, "")
                    val app_url: String = zikrs?.arabic_desc + "\n\n " +
                            "" + zikrs?.reading_txt + " \n\n  " +
                            "" +
                            "https://play.google.com/store/apps/details?id=com.example.administrator"
                    shareIntent1.putExtra(Intent.EXTRA_TEXT, app_url)
                    startActivity(Intent.createChooser(shareIntent1, "Поделиться через"))
                }

            })
        }else{
            binding.rv10.layoutManager = LinearLayoutManager(this, LinearLayoutManager.VERTICAL,false)
            binding.rv10.adapter = MorningZikrsAdapter(items11, object : OnItemClickListener {
                override fun onItemClick(tests: FeaturesModel?) {
                }

                override fun onItemImageClickListener(zikrs: MorningZikrsModel?) {
                    val shareIntent1 = Intent(Intent.ACTION_SEND)
                    shareIntent1.type = "text/plain"
                    shareIntent1.putExtra(Intent.EXTRA_SUBJECT, "")
                    val app_url: String = zikrs?.arabic_desc + "\n\n " +
                            "" + zikrs?.reading_txt + " \n\n  " +
                            "" +
                            "https://play.google.com/store/apps/details?id=com.example.administrator"
                    shareIntent1.putExtra(Intent.EXTRA_TEXT, app_url)
                    startActivity(Intent.createChooser(shareIntent1, "Поделиться через"))
                }

            })
        }

        binding.backIcon2.setOnClickListener {
            val intent: Intent = Intent(
                this,
                ZikrActivity::class.java
            )
            intent.setFlags(Intent.FLAG_ACTIVITY_CLEAR_TOP)
            finish ()
        }

    }
}