package com.example.popjomemasjidi.activitys

import android.content.Intent
import androidx.appcompat.app.AppCompatActivity
import android.os.Bundle
import androidx.recyclerview.widget.LinearLayoutManager
import com.example.popjomemasjidi.activitys.adapters.NamozAdapter
import com.example.popjomemasjidi.activitys.models.NamozModel
import com.example.popjomemasjidi.databinding.ActivityNamozBinding
import com.example.popjomemasjidi.fragments.FirstFragment

class NamozActivity : AppCompatActivity() {

    private lateinit var binding: ActivityNamozBinding

    var items3 = arrayOf(
        NamozModel(
            "Таҳорат қилганда",
            1,
            "Таҳорат қилганда\n" +
                    "\n" +
                    "Умар ибн Хаттоб розияллоҳу анҳудан ривоят қилинади:\n" +
                    "Расулуллоҳ соллаллоҳу алайҳи васаллам: «Ким таҳорат қилиб бўлиб:\n" +
                    "\n" +
                    "أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ الله وَحْدَهُ لاَ شَرِيكَ لَهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ\n" +
                    "\n" +
                    "«Ашҳаду анла илаҳа иллаллоҳу ваҳдаҳу ла шарийка лаҳу ва ашҳаду анна Муҳаммадан ъабдуҳу ва росулуҳу», деса, унга жаннатнинг саккизта эшиги очилиб, хоҳлаганидан кираверади», дедилар.\n" +
                    "\n" +
                    "Имом Муслим ривоятлари.\n"
        ),
        NamozModel("Масжидга кетаётганда",2,"Масжидга кетаётганда\n" +
                "\n" +
                "Ибн Аббос розияллоҳу анҳудан ривоят қилинади:\n" +
                "У зот холалари Маймуна розияллоҳу анҳунинг уйларида тунаб қолганларида, Расулуллоҳ соллаллоҳу алайҳи васалламнинг қуйидаги ишларига гувоҳ бўлганини айтадилар:\n" +
                "«Набий соллаллоҳу алайҳи васаллам муаззиннинг бомдодга айтган азонини эшитдилар, сўнг намозга кетатуриб, қуйидаги дуони ўқидилар:\n" +
                "\n" +
                "اللهُمَّ اجْعِلْ فِي قَلْبِي نُورًا وَفِي لِسَانِي نُورًا وَاجْعَلْ فِي سَمْعِي نُورًا وَاجْعَلْ فِي بَصَرِي نُورًا وَاجْعَلْ مِنْ خَلْفِي نُورًا وَمِنْ أَمَامِي نُورًا وَاجْعَلْ مِنْ فَوقِي نُورًا وَمِنْ تَحْتِي نُورًا، اللهُمَّ اعْطِنِي نُورًا\n" +
                "\n" +
                "«Аллоҳуммажъал фий қолбий нурон ва фий лисаний нурон важъал фий самъий нурон важъал фий басорий нурон важъал мин холфий нурон ва мин амамий нурон важъал мин фавқий нурон ва мин таҳтий нурон, Аллоҳуммаътиний нуро».\n" +
                "(Маъноси: Эй Раббим, қалбимда нур қил, тилимда нур қил, қулоғимда нур қил, кўзимда нур қил, орқамдан нур қил, олдимдан нур қил, устимдан нур қил, остимдан нур қил, эй Раббим, менга нур ато эт). \n" +
                "\n" +
                "Имом Муслим ривоятлари."),
        NamozModel("Масжидга кираётганда ва ундан чиқаётганда",3,"Масжидга кираётганда ва ундан чиқаётганда\n" +
                "\n" +
                "Абу Ҳумайд ёки Абу Усайдлардан ривоят қилинади:\n" +
                "“Расулуллоҳ соллаллоҳу алайҳи васаллам айтдилар:\n" +
                "«Агар бирортангиз масжидга кирса, Расулуллоҳ соллаллоҳу алайҳи васалламга салом айтиб, сўнг:\n" +
                "\n" +
                "اللهُمَّ افْتَحْ لِي أبْوَابَ رَحْمَتِكَ\n" +
                "\n" +
                "«Аллоҳуммафтаҳ лий абваба роҳматик», деб айтсин.\n" +
                "(Маъноси: Эй Раббим, бизга раҳмат эшикларини очгин)\n" +
                "\n" +
                "Чиққанида эса:\n" +
                "اللهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ\n" +
                "\n" +
                "«Аллоҳумма инний ас`алука мин фазлик», десин».\n" +
                "(Маъноси: Эй Раббим, Сенинг фазлингни сўрайман.)\n" +
                "Бу ҳадисни Имом Муслим ривоят қилганлар. Лекин у зотнинг ривоятларида «Расулуллоҳга салом айтсин», деган лафз йўқ.\n"),
        NamozModel("Азон ва иқоматни эшитганда",4,"Азон ва иқоматни эшитганда\n" +
                "\n" +
                "Абу Саид Худрий розияллоҳу анҳудан ривоят қилинади:\n" +
                "Расулуллоҳ соллаллоҳу алайҳи васаллам:\n" +
                "«Азонни эшитганингларда муаззин нима деса, ўшани айтинглар», дедилар.\n" +
                "\n" +
                "Имом Бухорий ва Муслим ривоятлари.\n" +
                "\n" +
                "Азоннинг ҳаммасини эшитиб бўлганидан кейин Расулуллоҳга саловот айтиб, ортидан мана бу дуони ўқийди:\n" +
                "Жобир розияллоҳу анҳудан ривоят қилинади:\n" +
                "Расулуллоҳ соллаллоҳу алайҳи васаллам: Ким азонни эшитган пайтида\n" +
                "\n" +
                "اللهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ وَالصَّلاَةِ القَائِمَةِ آتِ مُحَمَّدًا الوَسِيلَةَ وَالفَضِيلَةَ وَابْعَثْهُ مَقَامًا مُحْمُودًا الَّذِي وَعَدْتَهُ\n" +
                "\n" +
                "«Аллоҳумма робба ҳазиҳид даъватит таммаҳ вассолатил қоимаҳ, ати Муҳаммаданил васийлата вал фазийлаҳ вабъасҳу мақомам маҳмуданиллазий ваъадтаҳ», деб айтса, Қиёмат куни унга шафоат бўлади”, дедилар. \n" +
                "(Маъноси: Эй бу комил дуонинг ва қоим бўлган намознинг эгаси - Аллоҳим, Муҳаммадга васила ва фазилат бер, у зотни ваъда қилганинг мақтовли мақомда тирилтир), деб сўнгра хоҳлаганича дунёвий ва ухровий дуоларни қилаверади.)\n" +
                "\n" +
                "Абу Довуд ривоятлари."),
        NamozModel("Намоз бошланганда",5,"Намоз бошланганда\n" +
                "\n" +
                "Оиша онамиз розияллоҳу анҳодан ривоят қилинади:\n" +
                "Расулуллоҳ соллаллоҳу алайҳи васаллам намозни бошласалар:\n" +
                "\n" +
                "سُبْحَانَكَ اللهُمَّ وَبِحَمْدِكَ وَتَبَارَكَ اسْمُكَ وَتَعَالى جَدُّكَ وَلاَ إِلَهَ غَيْرُكَ\n" +
                "\n" +
                "«Субҳанакаллоҳумма ва биҳамдика ва табарокасмука ва таъала жаддука ва ла илаҳа ғойрук», дер эдилар.\n" +
                "(Маъноси: Эй Раббим, Сенга ҳамд айтиш билан Сени айбу нуқсонлардан поклайман. Сенинг исминг муборакдир. Азаматинг олийдир. Сендан бошқа илоҳ йўқдир.)"),
        NamozModel("Намоздаги рукуъда",6,"Намоздаги рукуъда\n" +
                "\n" +
                "Намоз ўқиётган киши рукуъга тўла эгилса;\n" +
                "\n" +
                "سُبْحَانَ رَبِّيَ العَظِيمِ، سُبْحَانَ رَبِّيَ العَظِيمِ، سُبْحَانَ رَبِّيَ العَظِيمِ\n" +
                "\n" +
                "«Субҳана роббийал ъазийм», деб рукуъ зикрларини айтади.\n" +
                "(Маъноси: Улуғ Раббим нуқсонлардан покдир.)\n"),
        NamozModel("Рукуъдан бош кўтарганда ва тик турганда",7,"Рукуъдан бош кўтарганда ва тик турганда\n" +
                "\n" +
                "Абу Ҳурайра розияллоҳу анҳудан ривоят қилинади:\n" +
                "Расулуллоҳ соллаллоҳу алайҳи васаллам рукуъдан қоматларини кўтарганларида:\n" +
                "\n" +
                "سَمِعَ اللهُ لِمَنْ حَمِدَهُ رَبَّنَا لَكَ الْحَمْدُ\n" +
                "\n" +
                "«Самиъаллоҳу лиман ҳамидаҳ» (Ким ҳамд айтса, Аллоҳ уни эшитади), тик бўлганларида эса, «Роббана лакал ҳамд» (Раббимиз, Сенга ҳамд бўлсин), деб айтар эдилар. \n" +
                "(Баъзи ривоятларда: «Роббана ва лакал ҳамд» бўлиб келган). \n" +
                "\n" +
                "Имом Бухорий ва Муслим ривоятлари."),
        NamozModel("Сажда пайтида",8,"Сажда пайтида\n" +
                "\n" +
                "Расулуллоҳ алайҳиссалом: «Агар бирортангиз сажда қилса, камида уч марта:\n" +
                "\n" +
                "سُبْحَانَ رَبِّيَ الأَعْلَى، سُبْحَانَ رَبِّيَ الأَعْلَى، سُبْحَانَ رَبِّيَ الأَعْلَى\n" +
                "\n" +
                "«Субҳана роббийал аъла, Субҳана роббийал аъла, Субҳана роббийал аъла», деб айтсин», дедилар.\n" +
                "\n" +
                "Сунан китобларида ривоят қилинган."),
        NamozModel("Витр намозидаги қунут дуоси",9,"Витр намозидаги қунут дуоси\n" +
                "\n" +
                "اللهُمَّ إِنَّا نَسْتَعِينُكَ وَنَسْتَغْفِرُكَ وَنُؤْمِنُ بِكَ وَنَتَوَكَّلُ عَلَيْكَ وَنُسْنِي عَلَيْكَ الْخَيْرَ كُلَّهُ نَشْكُرُكَ وَلاَ نَكْفُرُكَ وَنَخْلَعُ وَنَتْرُكُ مَنْ يَفْجُرُكَ، اللهُمَّ إِيَّاكَ نَعْبُدُ وَلَكَ نُصَلِّي وَنَسْجُدُ وَإِلَيْكَ نَسْعَي وَنَحْفِدُ نَرْجُو رَحْمَتَكَ وَنَخْشَى عَذَابَكَ إِنَّ عَذَابَكَ بِالكُفَّارِ مُلْحِقٌ\n" +
                "\n" +
                "Аллоҳумма инна настаъийнука ва настағфирука ва ну`мину бика ва натаваккалу ъалайка ва нусний ъалайкал хойро куллаҳ, нашкурука ва ла накфурука ва нахлаъу ва натруку май йафжурук. Аллоҳумма иййака наъбуду ва лака нусоллий ва насжуду ва илайка насъа ва наҳфиду наржу роҳматака ва нахша ъазабака инна ъазабака билкуффари мулҳиқ».\n" +
                "(Маъноси: Эй Раббим, Сенинг ёрдам беришингни, ҳидоят қилишингни, гуноҳларни кечишингни сўрайман. Сенга тавба қилдим, иймон келтирдим ва Сенга суяндим. Яхшиликларнинг барчаси билан Сени сифатлаймиз. Сенга шукр қиламиз, ношукрлик қилмаймиз. Сенга фожирлик қилганлардан четлашамиз. Эй Раббим, Сенга ибодат, намоз, сажда этамиз. Ва Сенинг йўлингда саъй-ҳаракат қилиб, раҳматингни умид қиламиз. Азобингдан қўрқамиз. Албатта, ҳақ азобинг кофирларга рўпара қилинувчидир.)"),
        NamozModel("Ташаҳҳуд",10,"Ташаҳҳуд\n" +
                "\n" +
                "Ибн Масъуд розияллоҳу анҳудан ривоят қилинади:\n" +
                "Расулуллоҳ соллаллоҳу алайҳи васаллам ташаҳҳудда:\n" +
                "\n" +
                "اَلتَّحِيَّاتُ للهِ وَالصَّلَوَاتُ وَالطَيِّبَاتُ السَّلاَمُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللهِ وَبَرَكَاتُهُ السَّلاَمُ عَلَيْنَا وَعَلَى عِبَادِ اللهِ الصَّالِحِينَ، أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ\n" +
                "\n" +
                "«Аттаҳиййату лиллаҳи вассолавату ваттоййибат ассаламу ъалайка аййуҳан набиййу ва роҳматуллоҳи ва барокатуҳ. Ассаламу ъалайна ва ъала ъибадиллаҳис солиҳийн. Ашҳаду алла илаҳа иллаллоҳу ва ашҳаду анна Муҳаммадан ъабдуҳу ва росулуҳ», деб айтдилар.\n" +
                "(Маъноси: «Саломлар, дуолар ва яхшиликларнинг барчаси Аллоҳ учундир. Эй Пайғамбар, сизга салом ва Аллоҳнинг раҳматию баракоти бўлсин. Бизларга ва Аллоҳнинг солиҳ бандаларига ҳам салом бўлсин. Аллоҳдан бошқа илоҳ йўқ деб гувоҳлик бераман. Ва яна Муҳаммад Аллоҳнинг бандаси ва расули деб гувоҳлик бераман.)\n" +
                "\n" +
                "Имом Бухорий ва Муслим ривоятлари."),
        NamozModel("Ташаҳҳуддан кейинги саловотлар",11,"Ташаҳҳуддан кейинги саловотлар\n" +
                "\n" +
                "اللهُمَّ صَلِّ عَلَى مُحَمَّدٍ وعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إبْرَاهِيمَ وَعَلَى آلِ إبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ. اللهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ.\n" +
                "\n" +
                "«Аллоҳумма солли ъала Муҳаммадин ва ъала али Муҳаммад, кама соллайта ъала Иброҳийма ва ъала али Иброҳийм, иннака ҳамийдум мажийд. Аллоҳумма барик ъала Муҳаммадин ва ъала али Муҳаммад, кама барокта ъала Иброҳийма ва ъала али Иброҳийм, иннака ҳамийдум мажийд».\n" +
                "(Маъноси: Аллоҳим, Иброҳим алайҳиссаломни ва у зотнинг оилаларини яхшилик ва раҳматда қилганинг каби Муҳаммад алайҳиссаломни ва у зотнинг оилаларини ҳам яхшилик ва раҳматда қил. Албатта, Сен мақтовга лойиқ улуғ зотсан. Аллоҳим, Иброҳим алайҳиссаломни ва у зотнинг оилаларини баракотли қилганингдек, Муҳаммад алайҳиссаломни ва у зотнинг оилаларини ҳам баракотли қил. Албатта, Сен мақтовга лойиқ улуғ зотсан.)"),
        NamozModel("Calendar event",12,"Намоз тугаганда\n" +
                "\n" +
                "Савбон розияллоҳу анҳудан ривоят қилинади:\n" +
                "Расулуллоҳ соллаллоҳу алайҳи васаллам намозни тугатсалар, уч марта «Астағфируллоҳ», деб сўнгра:\n" +
                "\n" +
                "اللهُمَّ أَنْتَ السَّلاَمُ وَمِنْكَ السَّلاَمُ تَبَارَكْتَ يَا ذَا الْجَلاَلِ وَالإِكْرَامِ\n" +
                "\n" +
                "«Аллоҳумма антас салам ва минкас салам, табарокта йа зал жалали вал икром», деб айтар эдилар.\n" +
                "(Маъноси: Эй Аллоҳим, Сен саломсан ва салом Сендандир. Эй улуғ ва ҳурматли зот, Сен баракотлисан.)\n" +
                "\n" +
                "Имом Муслим ривоятлари.\n" +
                "\n" +
                "* Муғийра ибн Шўъба розияллоҳу анҳудан ривоят қилинади:\n" +
                "Расулуллоҳ соллаллоҳу алайҳи васаллам намоздан фориғ бўлсалар:\n" +
                "\n" +
                "لاَ إِلَهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، اللهُمَّ لاَ مَانِعَ لِمَا أَعْطَيْتَ وَلاَ مُعْطِيَ لِمَا مَنَعْتَ وَلاَ يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ\n" +
                "\n" +
                "«Ла илаҳа иллаллоҳу ваҳдаҳу ла шарийка лаҳу, лаҳул мулку ва лаҳул ҳамду ва ҳува ъала кулли шай`ин қодир. Аллоҳумма ла маниъа лима аътойта ва ла муътийа лима манаъта ва ла йанфаъу зал жадди минкал жадд»ни ўқир эдилар.\n" +
                "(Маъноси: «Аллоҳдан ўзга илоҳ йўқ, Унинг шериги ҳам йўқ. Мутлақ мулк Уники ва ҳамд ҳам Унгадир. У ҳар нарсага қодирдир. Эй Раббим, Сен берган нарсани манъ қилувчи йўқ. Ва Сен манъ қилган нарсани берувчи йўқ. Буюклик Сендандир, бошқанинг буюклиги фойда бермайди.)\n" +
                "\n" +
                "Имом Бухорий ва Муслим ривоятлари.\n" +
                "\n" +
                "Абу Ҳурайра розияллоҳу анҳудан ривоят қилинади:\n" +
                "Расулуллоҳ алайҳиссалом:\n" +
                "«Ким ҳар бир намоз сўнгида ўттиз уч мартадан «субҳаналлоҳ, алҳамдулиллаҳ, Аллоҳу акбар», деб юзинчисини\n" +
                "\n" +
                "لاَ إِلَهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ\n" +
                "\n" +
                "«Ла илаҳа иллаллоҳу ваҳдаҳу ла шарийка лаҳ, лаҳул мулку ва лаҳул ҳамду ва ҳува ъала кулли шай`ин қодийр», деб айтса, гуноҳлари денгиз кўпигича бўлса ҳам, кечирилади», дедилар.\n" +
                "\n" +
                "Имом Муслим ривоятлари.\n" +
                "\n" +
                "* Муоз розияллоҳу анҳудан ривоят қилинади:\n" +
                "Расулуллоҳ соллаллоҳу алайҳи васаллам менинг қўлларимдан ушлаб: «Эй Муоз, Аллоҳга қасамки, мен сени яхши кўраман ва сенга ҳар намоз сўнгида \n" +
                "\n" +
                "اللهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ\n" +
                "\n" +
                "«Аллоҳумма аъинний ъала зикрика ва шукрика ва ҳусни ъибадатик»ни айтишни тавсия қиламан», дедилар».\n" +
                "(Маъноси: Эй Аллоҳим, Сени зикр этишда, Сенга шукр қилишда ва ибодатингни гўзал бажаришда менга ёрдам бер.)\n" +
                "\n" +
                "Абу Довуд ва Насаий ривоятлари.\n" +
                "\n" +
                "* Абу Бакра розияллоҳу анҳудан ривоят қилинади:\n" +
                "Расулуллоҳ соллаллоҳу алайҳи васаллам намоз сўнгида:\n" +
                "\n" +
                "اللهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الكُفْرِ وَالفَقْرِ وَعَذَابِ القَبْرِ\n" +
                "\n" +
                "«Аллоҳумма инний аъузу бика минал куфри вал фақри ва ъазабил қобр», деб айтар эдилар.\n" +
                "(Маъноси: Аллоҳим, куфрдан, камбағалликдан ва қабр азобидан Сендан паноҳ тилайман.)\n" +
                "\n" +
                "Ибн Сунний ривоятлари."),
        NamozModel("Қуръон хатм қилинганда",13,"Қуръон хатм қилинганда\n" +
                "\n" +
                "اللهُمَّ ارْحَمْنِي بِالْقُرْءَانِ وَاجْعَلْهُ لِي إمَامًا وَنُورًا وَهُدًى وَرَحْمَةً، اللهُمَّ ذَكِّرْنِي مِنْهُمَا نَسِيْتُ وَعَلِّمْنِي مِنْهُمَا جَهِلْتُ وَارْزُقْنِي تِلاَوَتَهُ آنَاءَ اللَّيْلِ وَأطْرَافَ النَّهَارِ وَاجْعَلْهُ لِي حُجَّةً يَا رَبَّ العَالَمِينَ. اَللَّهُمَّ أَصْلِحْ لِي دِيْنِي الَّذِي هُوَ عِصْمَةُ أَمْرِي، وَأَصْلِحْ لِي دُنْيَاىَ الَّتِي فِيْهَا مَعَاشِي، وَأَصْلِحْ لِي آخِرَتِي الَّتِي فِيْهَا مَعَادِي، وَاجْعَلِ الْحَيَاةَ زِيَادَةً لِي فِي كُلِّ خَيْرٍ وَاجْعَلِ الْمَوتَ رَاحَةً لِي مِنْ كُلِّ شَرٍّ. \n" +
                "اللهُمَّ اجْعَلْ خَيْرَ عُمْرِي آخِرَهُ وَخَيْرَ عَمَلِي خَوَاتِمَهُ وَخَيْرَ أيَّامِي يَومَ ألْقَاكَ فِيهِ. اللهُمَّ إنِّي أَسْألُكَ عِيْشَةً هَنِيَّةً وَمِيتَةً سَوِيَّةً وَمَرَدًّا غَيْرَ مُخْزٍى وَلاَ فَاضِحٍ. اللهُمَّ إنِّي أسْأَلُكَ خَيْرَ الْمَسْألَةِ وَخَيْرَ الدُّعَاءِ وَخَيْرَ النَّجَاحِ وَخَيْرَ العِلْمِ وَخَيْرَ العَمَلِ وَخَيْرَ الثَّوَابِ وَخَيرَ الْحَيَاةِ وَخَيْرَ الْمَمَاتِ وَثَبِّتْنِي وَثَقِّلْ مَوَازِينِي وَحَقِّقْ إيْمَانِي وَارْفَعْ دَرَجَتِي وَتَقَبَّلْ صَلاَتِي وَاغْفِرْ خَطِيئاتِي وَأسْأَلُكَ العُلاَ مِنَ الْجَنَّةِ. اللَّهُمَّ إِنَّي أسْأَلُكَ مُوْجِبَاتِ رَحْمَتِكَ وَعَزَائِمَ مَغْفِرَتِكَ وَالسَّلاَمَةَ مِنْ كُلِّ إِثْمٍ وَالغَنِيْمَةَ مِنْ كُلِّ بِرٍّ وَالفَوزَ بِالْجَنَّةِ وَالنَّجَاةَ مِنَ النَّارِ. \n" +
                "اللهُمَّ أحْسِنْ عَاقِبَتَنَا فِي الأُمُورِ كُلِّهَا وَأجِرْنَا مِنْ خِزْيِ الدُّنْيَا وَعَذَابِ الآخِرَةِ. \n" +
                "اللهُمَّ اقْسِمْ لَنَا مِنْ خَشْيَتِكَ مَا يَحُولُ بَيْنَنَا وَبَيْنَ مَعَاصِيْكَ وَمِنْ طَاعَتِكَ مَا تُبَلِّغُنَا بِهِ جَنَّتَكَ وَمِنَ اليَقِيْنِ مَا تُهَوِّنُ بِهِ عَلَيْنَا مَصَائِبَ الدُّنْيَا. اللهُمَّ مَتِّعْنَا بِأَسْمَاعِنَا وَأَبْصَارِنَا وَقُوَّتِنَا مَا أَحْيَيْتَنَا وَاجْعَلْهُ الوَارِثَ مِنَّا وَاجْعَلْ ثَأْرَنَا عَلَى مَنْ ظَلَمَنَا وَانْصُرْنَا عَلَى مَنْ عَادَانَا وَلاَ تَجْعَلْ مُصِيْبَتَنَا فِي دِيْنِنَا وَلاَ تَجْعَلِ الدُّنْيَا أَكْبَرَ هَمِّنَا وَلاَ مَبْلَغَ عِلْمِنَا وَلاَ تُسَلِّطْ عَلَيْنَا مَنْ لاَ يَرْحَمُنَا. اللهُمَّ لاَ تَدَعْ لَنَا ذَنْبًا إلاَّ غَفَرْتَهُ وَلاَ هَمًّا إلاَّ فَرَّجْتَهُ وَلاَ دَيْنًا إلاَّ قَضَيْتَهُ وَلاَ حَاجَةً مِنْ حَوَائِجِ الدُّنْيَا وَالآخِرَةِ إلاَّ قَضَيْتَهَا يَا أرْحَمَ الرَّاحِمِينَ.\n" +
                "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ، وَصَلَّى اللهُ عَلَى نَبِيِّنَا مُحَمَّدٍ وَعَلَى آلِهِ وَأصْحَابِهِ الأَخْيَارِ وَسَلَّمَ تَسْلِيمًا كَثِيرًا.\n" +
                "\n" +
                "Аллоҳумма ирҳамний билқуръани, важъалҳу лий имамав ва нурон ва ҳудан ва роҳматан. Аллоҳумма заккирний минҳу маа насийту ва ъаллимний минҳу маа жаҳилту, варзуқний тилаватаҳу аана аллайли ва атрофан наҳар важъалҳу лий ҳужжатан йа роббал оламийн. \n" +
                "Аллоҳумма аслиҳ лий диний аллазий ҳува ъисмату амрий ва аслиҳ лий дуняйаллатий фийҳа маъаший ва аслиҳ лий охиратиллатий фийҳа маъадий, важъалил ҳаёта зиядатан фий кулли хойрин, важъалил мавта роҳатан лий мин кулли шаррин. \n" +
                "Аллоҳумма ижъал хойро умрий охираҳу ва хойра ъамалий хавотимаҳу ва хойра айёмий явма алқока фийҳи. \n" +
                "Аллоҳумма инний ас‘алука ъийшатан ҳаниййатан ва мийтатан савиййатан ва мараддан ғойра мухзин вала фазиҳин. \n" +
                "Аллоҳумма инний ас‘алука хойрал мас‘алати ва хойрад дуо‘и ва хойран нажаҳи ва хойрал ъилми ва хойрал ъамали ва хойрас савоби ва хойрал ҳаёти ва хойрал мамати ва саббитний ва саққил мавазийний ва ҳаққиқ ийманий варфаъ дарожатий ва тақоббал солатий, вағфир хатий‘атий ва ас‘алукал ъуло минал жаннати. \n" +
                "Аллоҳумма инний ас‘алука мувжибати роҳматика ва ъазоима мағфиротика вассаламата мин кулли исмин, валғониймата мин кулли биррин, валфавза билжаннати, ван нажата минан нар.\n" +
                "Аллоҳумма аҳсин оқибатана фил умури куллиҳа ва ажирна мин хизйид дуня ва ъазабил охира.\n" +
                "Аллоҳумма ақсим лана мин хошятика ма яҳулу байнана ва байна маъсиятика ва мин тоъатика ма тубаллиғуна биҳа жаннатака ва минал яқийни ма туҳаввину биҳи ъалайна масо‘ибаддунё. \n" +
                "Аллоҳумма маттиъна би‘асмаъина ва абсорина ва қувватина ма аҳяйтана важъалҳул вориса мина, важъал са‘рона ъала ман золамана вансурна ъала ман ъадана, вала тажъал мусийбатана фий дийнина, вала тажъалид дуня акбара ҳаммина вала маблаға ъилмина, вала тусаллит ъалайна ман ла ярҳамуна». \n" +
                "Аллоҳумма ла тадаъ лий занбан илла ғофартаҳу вала ҳамман илла фарражтаҳу вала дайнан илла қозайтаҳу вала ҳажатан мин ҳаваижид дуня вал охира илла қозайтаҳа йа арҳамар роҳимийн. \n" +
                "Роббана аатина фиддуня ҳасанатан, вафил охирати ҳасанатан, вақина ъазабан нар. Васаллаллоҳу ъала набиййина Муҳаммадин ваъала олиҳи ва асҳабиҳил ахйари васаллама таслийман касийро. \n" +
                "(Маъноси: «Аллоҳим, Қуръон сабабли бизга раҳм айлагин. Ва уни бизга йўлбошчи, нур, ҳидоят ва раҳмат қил. Аллоҳим унутган нарсаларимни менга эслат, жоҳиллик билан қилган хатоларимни менга билдир, кеча-ю кундузи уни тиловат қилиш ила мени ризқлантир. Эй оламлар Рабби! Уни менинг фойдамга ҳужжат қил. Аллоҳим, ишларимни сақловчи динимни ислоҳ эт. Яшайдиганим дунёимни ислоҳ қил. Қайтишим унга бўлган охиратимни ислоҳ айла. Ҳар бир яхшиликда ҳаётимни зиёда қил. Ва ҳар бир ёмонликда ўлимни роҳат қил.\n" +
                "Аллоҳим, ҳаётимни энг яхшисини умрим охирида қил, амалимни энг яхшисини хотимада қил ва кунларимнинг энг яхшисини Сенга йўлиқадиган кунда қил.\n" +
                "Аллоҳим, Сендан сўрашни яхшисини, яхши дуони, яхши муваффақиятни, яхши илмни, яхши амални, яхши савобни, яхши ҳаётни, яхши ўлимни сўрайман. Мени собитқадам қил, тарозумни оғир қил, иймонимни мустаҳкам қил, даражамни олий қил, намозимни қабул қил, хатоларимни кечир. Аллоҳим Сендан жаннатдаги олий мақомни сўрайман. Аллоҳим, раҳматингга мустаҳиқ бўладиган нарсани, мағфиратингни вожиб қиладиган нарсани, ҳар бир гуноҳдан саломат бўлишни ва ҳар бир яхшиликда ғаниматни ҳамда жаннат билан зафар қозонишни ва ёрдаминг билан дўзахдан нажот топишни сўрайман.\n" +
                "Аллоҳим, барча ишларда оқибатимизни хайрли қил ҳамда дунё хорлигидан ва охират азобидан бизга паноҳ бер. Аллоҳим, Сенга қилинадиган гуноҳ ила бизнинг орамизни тўсадиган қўрқувни ва жаннатингга етказадиган тоатингни ҳамда дунё мусибатларини бизга енгиллаштирадиган яқийнни улуш қилиб бер. Аллоҳим, бизни тириклигимизда қулоғимиз, кўзимиз ва қувватимиз ила нафлантириб, уни бизга меросхўр қил (яъни, вафот этгунимизча омонда қил). Ўчимизни бизга зулм қилганларга қарат! Душманларимиз зиёнига бизга нусрат бер. Мусибатимизни динимизда қилма. Дунёни энг катта ғамимиз ва охирги илмимиз қилма. Ва бизга раҳм қилмайдиганларни бизга бошлиқ этма.\n" +
                "Аллоҳим, бирор гуноҳ қолдирмасдан уни кечир, бирор ғам қолдирмасдан уни очиб юбор ва эй раҳм қилувчиларни раҳмлиси, бирор дунё ҳамда охират ҳожатларини қолдирмасдан уни рўёбга чиқар. Эй Раббимиз, бизга дунё ва охиратдаги яхшиликларни бер ва бизни дўзах азобидан сақла.\n" +
                "Набиййимиз Муҳаммад алайҳиссаломга, оилаларига ва яхши деб ном чиқарган саҳобаларига кўпдан-кўп салавоту-саломлар бўлсин."),
        NamozModel("Ҳамма дуоларни ўзида жамлаган зикр",14,"Ҳамма дуоларни ўзида жамлаган зикр\n" +
                "\n" +
                "Абу Умома розияллоҳу анҳудан ривоят қилинади:\n" +
                "“Расулуллоҳ соллаллоҳу алайҳи васаллам жуда кўп дуолар билан илтижо қилардилар-у, биз ундан бирортасини ёдлаб қола олмас эдик. Шунда мен: «Эй Расулуллоҳ, кўп дуолар билан илтижо қиласиз-у биз ундан бирортасини ёдламаймиз», десам, у зот: «Ана шу дуоларнинг барчасини ўзида жамлаганига далолат қилайми? У:\n" +
                "\n" +
                "اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْر مَا سَأَلَكَ مِنْهُ نَبِيُّكَ مُحَمَّدٌ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَنَعُوذُ بِكَ مِنْ شَرِّ مَا اسْتَعَاذَكَ مِنْهُ نَبِيُّكَ مُحَمَّدٌ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَأَنْتَ الْمُسْتَعَانُ وَعَلَيْكَ البَلاَغُ، وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللهِ.\n" +
                "\n" +
                "«Аллоҳумма инний асъалука мин хойри ма са‘алака минҳу набиййука Муҳаммадун соллаллоҳу алайҳи васаллам ва наъузу бика мин шарри мастаъозака минҳу набиййука Муҳаммадун соллаллоҳу алайҳи васаллам ва антал мустаъону ва ъалайкал балағу вала ҳавла вала қуввата илла биллаҳ»дир, дедилар. \n" +
                "(Маъноси: Аллоҳим, набиййинг Муҳаммад алайҳиссалом сўраган нарсаларнинг яхшисини Сендан сўрайман. Ва набиййинг Муҳаммад алайҳиссалом паноҳ сўраган нарсаларнинг ёмонидан паноҳ сўрайман. Ва Сен ёрдам сўралувчи зотсан. Етуклик Сенгадир. Аллоҳдан бошқа ўзгартирувчи ва қувват йўқдир.)\n" +
                "\n" +
                "Имом Термизий ривоятлари."),
        NamozModel("Истиғфорларнинг саййиди",15,"Истиғфорларнинг саййиди\n" +
                "\n" +
                "Шаддод ибн Авс розияллоҳу анҳудан ривоят қилинади:\n" +
                "“Расулуллоҳ соллаллоҳу алайҳи васаллам: «Ким саййидул истиғфор –\n" +
                " \n" +
                "اللَّهُمَّ أَنْتَ رَبِّي لاَ إِلَهَ إِلاَّ أَنْتَ خَلَقْتَنِي وَأَنَا عَبْدُكَ وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ وَأَبُوءُ بِذَنْبِي فَاغْفِرْ لِي، فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ\n" +
                "\n" +
                "«Аллоҳумма анта роббий ла илаҳа илла анта холақтаний ва ана ъабдука ва ана ъала ъаҳдика ва ваъдика мастатоъту аъузу бика мин шарри ма сонаъту, абу‘у лака биниъматика ъалаййа ва абу‘у бизамбий фағфирлий фаиннаҳу ла йағфируз зунуба илла анта»ни кечки пайт айтиб, шу куни вафот этса, жаннатга киради. Ким тонгда айтиб, шу куни вафот этса, унда ҳам жаннатга киради», дедилар.\n" +
                "(Маъноси: Аллоҳим, Сен Парвардигоримсан, Сендан бошқа илоҳ йўқ. Мени халқ қилдинг ва мен Сенинг қулингман. Мен Сенга берган ваъдамда ва Сенга берган аҳдимда қодир бўлганимча турибман. Қилган нарсаларимнинг ёмонидан Сенинг номинг билан паноҳ тилайман. Менга ато қилган неъматларингга иқрор бўлдим. Ва яна гуноҳларимга ҳам иқрор бўлдим. Менинг гуноҳларимни кечир. Чунки Сендан бошқаси гуноҳларимни кечира олмайди.)\n" +
                "\n" +
                "Имом Бухорий ривоятлари."),
        NamozModel("Истиғфор",16,"Истиғфор\n" +
                "\n" +
                "Ибн Масъуд розияллоҳу анҳудан ривоят қилинади:\n" +
                "Расулуллоҳ соллаллоҳу алайҳи васаллам: «Кимки:\n" +
                " \n" +
                "أَسْتَغْفِرُ اللهَ الَّذِي لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ القَيُّومُ وَأَتُوبُ إِلَيْهِ\n" +
                "\n" +
                "«Астағфируллоҳаллазий ла илаҳа илла ҳувал ҳаййул қаййум ва атубу илайҳи», деб айтса, (Аллоҳ ҳатто) урушдан қочгандаги гуноҳини ҳам кечириб юборади», дедилар. \n" +
                "(Маъноси: Барҳаёт, тирик Аллоҳдан авф этишини сўрайман ва Унга тавба қиламан.) \n" +
                "\n" +
                "Абу Довуд ва Термизий ривоятлари.\n" +
                "\n" +
                "Жобир ибн Абдуллоҳ розияллоҳу анҳудан ривоят қилинади:\n" +
                "Бир киши Расулуллоҳ соллаллоҳу алайҳи васаллам ҳузурларига келиб, «Вой гуноҳларим, вой гуноҳларим», деб икки ёки уч марта айтди. Расулуллоҳ соллаллоҳу алайҳи васаллам унга:\n" +
                "\n" +
                "اللَّهُمَّ مَغْفِرَتُكَ أَوْسَعُ مِنْ ذُنُوبِي وَرَحْمَتُكَ أَرْجَى عِنْدِي مِنْ عَمَلِي\n" +
                "\n" +
                "«Аллоҳумма мағфиратука авсаъу мин зунубий ва роҳматука аржа ъиндий мин ъамалий», деб айт», дедилар. У бу дуони ўқиди. Сўнгра Расулуллоҳ соллаллоҳу алайҳи васаллам такрорла, дедилар. Бас, у такрорлади. Сўнгра яна такрорла, дедилар. У яна такрорлади. Шунда Расулуллоҳ соллаллоҳу алайҳи васаллам: «Тур, батаҳқиқ мағфират қилиндинг», дедилар. \n" +
                "(Маъноси: Аллоҳим, мағфиратинг гуноҳимдан кенгроқдир. Раҳматинг ҳузуримдаги амалимдан умидлироқдир.)\n" +
                "\n" +
                "Имом Ҳоким ривоятлари.\n" +
                "\n" +
                "Абу Умома розияллоҳу анҳудан ривоят қилинади:\n" +
                "Расулуллоҳ соллаллоҳу алайҳи васаллам: «Албатта\n" +
                "\n" +
                "يَا أَرْحَمَ الرَّاحِمِيْنَ\n" +
                "\n" +
                "«Йа арҳамар роҳимийн» («Эй раҳм қилувчиларнинг раҳмлиси»), деб айтадиган кишиларга Аллоҳ таолонинг вакил қилинган фаришталари бордир. Кимки буни уч марта айтса, фаришталар у учун «Раҳм қилувчиларнинг раҳмлиси (Аллоҳ), Сенга юзланди, бас, Сен ундан сўрагин, дейишади».\n" +
                "\n" +
                "Имом Ҳоким ривоятлари."),
        NamozModel("Икки ҳайит намозида айтиладиган такбир",17,"Икки ҳайит намозида айтиладиган такбир\n" +
                "\n" +
                "اللهُ أَكْبَرُ اللهُ أَكْبَرُ اللهُ أَكْبَرُ لاَ إِلَهَ إِلاَّ اللهُ وَاللهُ أَكْبَرُ اللهُ أَكْبَرُ وَللهِ الْحَمْدُ\n" +
                "\n" +
                "«Аллоҳу акбар Аллоҳу акбар, Аллоҳу акбар, ла илаҳа иллаллоҳу валлоҳу акбар, Аллоҳу акбар ва лиллаҳил ҳамд».\n" +
                "(Маъноси: Аллоҳ улуғдир, Аллоҳ улуғдир, Аллоҳ улуғдир. Аллоҳдан бошқа илоҳ йўқ. Аллоҳ улуғдир, Аллоҳ улуғдир. Аллоҳга ҳамд бўлсин.)"),
    )

    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)
        binding = ActivityNamozBinding.inflate(layoutInflater)
        setContentView(binding.root)


        binding.rv9.layoutManager = LinearLayoutManager(this, LinearLayoutManager.VERTICAL,false)
        binding.rv9.adapter = NamozAdapter(items3)

        binding.backIcon.setOnClickListener {
            val intent: Intent = Intent(
                this,
                FirstFragment::class.java
            )
            intent.flags = Intent.FLAG_ACTIVITY_CLEAR_TOP
            finish ()
        }
    }
}